#include<stdio.h>//本来想编函数的，但是懒就硬上了...还差一个判断失败的，不过日后再加，反正加了一个退出的。
#include<stdlib.h>
int main()
{                  // 0    1   2   3   4   5   6   7   8   9 
    char a[10][10]={{'#', '#','#','#','#','#','#','#','#','#' } , //0
                    {'#', ' ','@',' ',' ',' ',' ',' ',' ','#' } , //1
                    {'#', ' ',' ',' ',' ',' ',' ',' ',' ','#' } , //2
                    {'#', ' ',' ',' ',' ',' ',' ',' ',' ','#' } , //3
                    {'#', ' ',' ',' ','a','s',' ',' ',' ','#' } , //4
                    {'#', '#',' ',' ',' ',' ',' ',' ',' ','#' } , //5
                    {'#', ' ','#',' ',' ',' ',' ',' ',' ','#' } , //6
                    {'#', ' ',' ',' ',' ',' ',' ',' ',' ','#' } , //7
                    {'#', ' ',' ',' ',' ',' ',' ','a','s','#' } , //8
                    {'#', '#','#','#','#','#','#','#','#','#' } };//9
    char x=1,y=2;
    int i,j;
    while(1)
    {
        system("CLS");
        printf("You are '@',try to push all 'a' to 's'\nYou can press'p'to break");
        for(i=0;i<=9;i++)
        {
            for(j=0;j<=9;j++)
            {
                printf("%c",a[i][j]);
            }
            printf("\n");
        }
        if(a[4][5]=='A' && a[8][8]=='A')//是否达成条件
        {
            printf("You win ! ! !\nPlease press enter to exit.");
            getchar();
            break;
        }
        a[x][y]=' ';
        char key;
        key=getch();
        switch(key)//移动
        {
            case 72:if(a[x-1][y]!='#'&&a[x-1][y]!='a'&&a[x-1][y]!='A')//上
                    {
                        x--;
                    }
                    else if(a[x-1][y]=='a'&&a[x-2][y]!='#')
                    {
                        a[x-2][y]='a';
                        x--;
                    }
                    else if(a[x-1][y]=='A'&&a[x-2][y]!='#')
                    {
                        a[x-2][y]='a';
                        x--;
                    }
                    break;
            case 80:if(a[x+1][y]!='#'&&a[x+1][y]!='a'&&a[x+1][y]!='A')//下
                    {
                        x++;
                    }
                    else if(a[x+1][y]=='a'&&a[x+2][y]!='#')
                    {
                        a[x+2][y]='a';
                        x++;
                    }
                    else if(a[x+1][y]=='A'&&a[x+2][y]!='#')
                    {
                        a[x+2][y]='a';
                        x++;
                    }
                    break;
            case 77:if(a[x][y+1]!='#'&&a[x][y+1]!='a'&&a[x][y+1]!='A')//右
                    {
                        y++;
                    }
                    else if(a[x][y+1]=='a'&&a[x][y+2]!='#')
                    {
                        a[x][y+2]='a';
                        y++;
                    }
                    else if(a[x][y+1]=='A'&&a[x][y+2]!='#')
                    {
                        a[x][y+2]='a';
                        y++;
                    }
                    break;
            case 75:if(a[x][y-1]!='#'&&a[x][y-1]!='a'&&a[x][y-1]!='A')//左
                    {
                        y--;
                    }
                    else if(a[x][y-1]=='a'&&a[x][y-2]!='#')
                    {
                        a[x][y-2]='a';
                        y--;
                    }
                    else if(a[x][y-1]=='A'&&a[x][y-2]!='#')
                    {
                        a[x][y-2]='a';
                        y--;
                    }
                    break;
            case'p': return 0;
        }
        if(a[4][5]=='a')
        {
            a[4][5]='A';
        }
        if(a[8][8]=='a')
        {
            a[8][8]='A';
        }
        a[x][y]='@';
        if(a[4][5]==' ')
        {
            a[4][5]='s';
        }
        if(a[8][8]==' ')
        {
            a[8][8]='s';
        }
    }
    return 0;
}