#include <stdio.h>
#include <windows.h>
#define MAX 12                                        /*关卡的行和列*/
#define MIN 3                                         /*一共三关*/

void Map(int *x,int *y,int *cnt);                                           /*刷新地图*/
void Move(const char A,int *x,int *y,int *cnt);                            /*人物的移动*/

int a[MIN][MAX][MAX] = {
    {
        {1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,0,4,1,1,1,1,1},
        {1,1,1,1,1,0,3,1,1,1,1,1},
        {1,1,1,1,1,0,0,1,1,1,1,1},
        {1,1,1,1,1,0,0,1,1,1,1,1},
        {1,1,4,3,0,2,0,0,3,4,1,1},
        {1,1,1,1,1,0,0,1,1,1,1,1},
        {1,1,1,1,1,0,0,1,1,1,1,1},
        {1,1,1,1,1,0,3,1,1,1,1,1},
        {1,1,1,1,1,0,4,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1},
    },
    {
        {1,1,1,1,1,1,1,1,1,1,1,1},
        {1,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,3,0,0,0,0,0,3,0,0,1},
        {1,4,0,1,1,0,1,1,0,0,4,1},
        {1,0,0,1,1,0,1,1,0,0,0,1},
        {1,0,0,3,0,0,0,3,0,0,0,1},
        {1,0,0,0,0,2,0,0,0,0,0,1},
        {1,0,0,1,1,0,0,1,1,1,0,1},
        {1,0,0,1,1,0,0,1,1,1,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,4,0,0,0,0,0,0,0,4,1},
        {1,1,1,1,1,1,1,1,1,1,1,1},
    },
    {
        {1,1,1,1,1,1,1,1,1,1,1,1},
        {1,4,0,0,0,1,0,0,0,0,4,1},
        {1,0,0,0,0,1,0,0,0,0,0,1},
        {1,0,0,0,0,1,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,1},
        {1,1,0,1,1,0,1,1,0,1,1,1},
        {1,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,2,0,0,0,0,0,1},
        {1,0,0,3,3,3,3,0,0,0,0,1},
        {1,0,0,0,0,1,0,0,0,0,0,1},
        {1,4,0,0,0,1,0,0,0,0,4,1},
        {1,1,1,1,1,1,1,1,1,1,1,1},
    },
};

/*
    0 路
    1 墙
    2 人物
    3 箱子
    4 终点
    5 箱子加终点
*/
int main(int argc,char const *argv[])
{
    int x,y,cnt = 0;                                /*人物坐标,关卡*/
    char A = 50;
    //system("chcp 65001");
    system("cls");
    while(cnt < 3 && A != 48)
    {
        Map(&x,&y,&cnt);
        A = getch();
        Move(A,&x,&y,&cnt);                         /*方向键,纵坐标，横坐标，关卡*/
        system("cls");
    }
    return 0;
}
void Move(const char A,int *x,int *y,int *cnt)
{
    /*
        1、人物上面是空格
        2、人物上面是箱子，箱子上面是空格则向前上一步,则人物和箱子同时向上一步
        2.1、人物上面是箱子，箱子上面是终点
    */
    switch(A)
    {/*上、下、左、右*/
        case 72:
        case 119:
        case 87:
            if(a[*cnt][*x-1][*y] == 0){                                                         /*1、人物上面是空格*/        
                a[*cnt][*x][*y] = 0;
                a[*cnt][*x-1][*y] = 2;
            }else if(a[*cnt][*x-1][*y] == 3 && a[*cnt][*x-2][*y] == 0){                         /*2、人物上面是箱子，箱子上面是空格则向前上一步,*/
                a[*cnt][*x][*y] = 0;                                                            /*则人物和箱子同时向上一步*/
                a[*cnt][*x-1][*y] = 2;
                a[*cnt][*x-2][*y] = 3;
            }else if(a[*cnt][*x-1][*y] == 3 && a[*cnt][*x-2][*y] == 4){                         /*2.1、人物上面是箱子，箱子上面是终点*/
                a[*cnt][*x][*y] = 0;
                a[*cnt][*x-1][*y] = 2;
                a[*cnt][*x-2][*y] = 5;
            }
            break;
        case 115:
        case 83:
        case 80:
            if(a[*cnt][*x+1][*y] == 0){                                                         /*1、人物下面是空格*/   
                a[*cnt][*x][*y] = 0;
                a[*cnt][*x+1][*y] = 2;
            }else if(a[*cnt][*x+1][*y] == 3 && a[*cnt][*x+2][*y] == 0){                         /*2、人物下面是箱子，箱子下面是空格则向前下移一步,*/
                a[*cnt][*x][*y] = 0;
                a[*cnt][*x+1][*y] = 2;
                a[*cnt][*x+2][*y] = 3;
            }else if(a[*cnt][*x+1][*y] == 3 && a[*cnt][*x+2][*y] == 4){                         /*2.1、人物下面是箱子，箱子下面是终点*/
                a[*cnt][*x][*y] = 0;
                a[*cnt][*x+1][*y] = 2;
                a[*cnt][*x+2][*y] = 5;
            }
            break;
        case 75:
        case 97:
        case 65:
            if(a[*cnt][*x][*y-1] == 0){                                                         /*1、人物左面是空格*/
                a[*cnt][*x][*y] = 0;
                a[*cnt][*x][*y-1] = 2;
            }else if(a[*cnt][*x][*y-1] == 3 && a[*cnt][*x][*y-2] == 0){                         /*2、人物左边是箱子，箱子左边是空格则向前左移一步,*/
                a[*cnt][*x][*y] = 0;
                a[*cnt][*x][*y-1] = 2;
                a[*cnt][*x][*y-2] = 3;
            }else if(a[*cnt][*x][*y-1] == 3 && a[*cnt][*x][*y-2] == 4){                         /*2.1、人物左边是箱子，箱子左边是终点*/
                a[*cnt][*x][*y] = 0;
                a[*cnt][*x][*y-1] = 2;
                a[*cnt][*x][*y-2] = 5;
            }
            break;
        case 100:
        case 77:
        case 68:
            if(a[*cnt][*x][*y+1] == 0){                                                         /*1、人物左面是空格*/
                a[*cnt][*x][*y] = 0;
                a[*cnt][*x][*y+1] = 2;
            }else if(a[*cnt][*x][*y+1] == 3 && a[*cnt][*x][*y+2] == 0){                         /*2、人物左边是箱子，箱子左边是空格则向前左移一步,*/
                a[*cnt][*x][*y] = 0;
                a[*cnt][*x][*y+1] = 2;
                a[*cnt][*x][*y+2] = 3;
            }else if(a[*cnt][*x][*y+1] == 3 && a[*cnt][*x][*y+2] == 4){                         /*2.1、人物左边是箱子，箱子左边是终点*/
                a[*cnt][*x][*y] = 0;
                a[*cnt][*x][*y+1] = 2;
                a[*cnt][*x][*y+2] = 5;
            }
            break;
    }
}
void Map(int *x,int *y,int *cnt)
{
    int i,n,number = 0 ;
    for(i=0;i<MAX;i++)
    {
        for(n=0;n<MAX;n++)
        {
            switch(a[*cnt][i][n])
            {
                case 0:
                    printf("  ");
                    break;
                case 1:
                    printf("■");
                    break;
                case 2:
                    printf("♀");
                    break;
                case 3:
                    printf("◎");
                    break;
                case 4:
                    printf("☆");
                    break;
                case 5:
                    printf("★");
                    break;
            }
            if(a[*cnt][i][n] == 2)
            {
                *x = i,*y = n;
            }
            if(a[*cnt][i][n] == 5){
                number ++;
            }
        }
        printf("\n");
    }
    
    if(number == 4 && *cnt < 3){
        *cnt +=1,number = 0;
    }
    printf("\n 第 %d 关，人物的位置是(x,y) x = %d , y = %d\n",*cnt+1,*x+1,*y+1);
    printf("\n ♀ 人物，■ 墙,空白的地方则是路 \n");
    printf("\n 您只需把 ◎ 推到 ☆ 所在的位置即可\n");
    printf("\n 当你通过一关的时候，程序将自动为你跳转下一关\n");
    printf("\n 退出请按 0 \n");
}
/*

    如何来判断用户是否通关，首先 我们设立三关，每一关的箱子加终点的数分别为、4、4、4，那
么，箱子和终点的数量也是一样的,当箱子和终点的位置一样时，则变成 5 ；当积累到 4 个 5 时，cnt++.

*/
